In [2]:
import pandas as pd

Below is a csv table with movie names, a studio abbreviation, the domestic gross, the foreign gross, and the year.

In [20]:
bom = pd.read_csv('./data/bom.movie_gross.csv.gz')
pd.read_csv('./data/bom.movie_gross.csv.gz')

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010
...,...,...,...,...,...
3382,The Quake,Magn.,6200.0,NaN,2018
3383,Edward II (2018 re-release),FM,4800.0,NaN,2018
3384,El Pacto,Sony,2500.0,NaN,2018
3385,The Swan,Synergetic,2400.0,NaN,2018
3386,An Actor Prepares,Grav.,1700.0,NaN,2018

In [19]:
bom['foreign_gross'].isnull().sum() #keep
bom['studio'].isnull().sum() #keep until we merge

5

In [15]:
df = pd.read_csv('./data/rt.movie_info.tsv.gz', delimiter = '\t')

#pd.read_csv('./data/rt.movie_info.tsv.gz', delimiter = '\t')

In [16]:
df['box_office'].isnull().sum() #too much nullvalues to be able use this dataset
                                #no name section so can't do much

1220

In [11]:
#this one has some funky encoding in it? It doesn't use utf-8 but latin1
# utf-8 and latin1 are the most common encoding but there can be others

# pd.read_csv('./data/rt.reviews.tsv.gz', delimiter = '\t', encoding= 'latin1' )

In [32]:
tmdb = pd.read_csv('./data/tmdb.movies.csv.gz')
pd.read_csv('./data/tmdb.movies.csv.gz')

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186
...,...,...,...,...,...,...,...,...,...,...
26512,26512,"[27, 18]",488143,en,Laboratory Conditions,0.600,2018-10-13,Laboratory Conditions,0.0,1
26513,26513,"[18, 53]",485975,en,_EXHIBIT_84xxx_,0.600,2018-05-01,_EXHIBIT_84xxx_,0.0,1
26514,26514,"[14, 28, 12]",381231,en,The Last One,0.600,2018-10-01,The Last One,0.0,1
26515,26515,"[10751, 12, 28]",366854,en,Trailer Made,0.600,2018-06-22,Trailer Made,0.0,1
26516,26516,"[53, 27]",309885,en,The Church,0.600,2018-10-05,The Church,0.0,1

In [24]:
tmdb['vote_count'].isnull().sum()

0

In [26]:
tmdb['title'].isnull().sum()

0

In [27]:
tmdb['original_title'].isnull().sum()

0

In [28]:
tmdb['vote_count'].isnull().sum()

0

In [29]:
tmdb['vote_average'].isnull().sum()

0

In [31]:
tmdb['title'].unique().shape #deal with duplicates

(24688,)

In [35]:
tmdb['release_date'].isnull().sum()

0

In [37]:
tn = pd.read_csv('./data/tn.movie_budgets.csv.gz')
pd.read_csv('./data/tn.movie_budgets.csv.gz').head(1)
#check how many are 0 potentially but the zeros would make send in this case

   id  release_date   movie production_budget domestic_gross worldwide_gross
0   1  Dec 18, 2009  Avatar      $425,000,000   $760,507,625  $2,776,345,279

In [38]:
tn['release_date'].isnull().sum()

0

In [39]:
tn['movie'].isnull().sum()

0

In [40]:
tn['production_budget'].isnull().sum()

0

In [41]:
tn['domestic_gross'].isnull().sum()

0

In [42]:
tn['worldwide_gross'].isnull().sum()

0

In [59]:
import pandas as pd
import sqlite3
import zipfile as zf
import os

In [60]:
files = zf.ZipFile('./data/im.db.zip', 'r') #these lines create a im.db file which is too big to push
files.extractall() #these lines create a im.db file which is too big to push

In [61]:
con = sqlite3.connect("./im.db")

In [62]:
pd.read_sql("""
Select * 

From movie_basics
            
""", con).head()

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [63]:
#pd.read_sql("""
#Select * 

#From known_for
            
#""", con).head()

In [64]:
#pd.read_sql("""
#Select * 

#From movie_akas
            
#""", con).head()

In [65]:
#rating = pd.read_sql("""
#Select * 

#From movie_ratings
            
#""", con)

#rating

         movie_id  averagerating  numvotes
0      tt10356526            8.3        31
1      tt10384606            8.9       559
2       tt1042974            6.4        20
3       tt1043726            4.2     50352
4       tt1060240            6.5        21
...           ...            ...       ...
73851   tt9805820            8.1        25
73852   tt9844256            7.5        24
73853   tt9851050            4.7        14
73854   tt9886934            7.0         5
73855   tt9894098            6.3       128

[73856 rows x 3 columns]

In [66]:
#rating['movie_id'].isnull().sum()

0

In [67]:
#rating['averagerating'].isnull().sum()

0

In [68]:
#rating['numvotes'].isnull().sum()

0

In [69]:
#pd.read_sql("""
#Select * 

#From persons
#where primary_profession like '%director%'
            
#""", con) #keep in back-pocket
        # maybe discuss in the next-steps

,person_id,primary_name,birth_year,death_year,primary_profession
0,nm0062879,Ruel S. Bayani,NaN,NaN,"director,production_manager,miscellaneous"
1,nm0064023,Bryan Beasley,NaN,NaN,"director,producer,writer"
2,nm0066163,Arnaud BedouÃ«t,NaN,NaN,"actor,writer,director"
3,nm0066268,Steve Mitchell Beebe,NaN,NaN,"editorial_department,director,editor"
4,nm0068170,Dylan Bell,NaN,NaN,"director,actor,producer"
...,...,...,...,...,...
146028,nm9971456,Zheng Wei,NaN,NaN,director
146029,nm9978371,Zach Campbell,NaN,NaN,"actor,cinematographer,assistant_director"
146030,nm9980896,Rama Narayanan,NaN,NaN,"director,writer"
146031,nm9981679,Samir Eshra,NaN,NaN,"director,writer,cinematographer"
146032,nm9993380,Pegasus EnvoyÃ©,NaN,NaN,"director,actor,writer"

In [70]:
#pd.read_sql("""
#Select * 

#From principals
            
#""", con).head()
#keep in back-pocket

In [71]:
#pd.read_sql("""
#Select * 

#From writers
            
#""", con).head()
#back pocket?

In [72]:
os.remove('im.db') #This line deletes the im.db file created earlier.

PermissionError: [WinError 32] The process cannot access the file because it is being used by another process: 'im.db'